app/controllers/api/v1/lists_controller.rb

  def index
    # byebug
    @lists = List.includes(:notes).all # adjust sql query to order how we want
---
SELECT "lists".* FROM "lists"
SELECT "notes".* FROM "notes" WHERE "notes"."list_id" = $1  [["list_id", 1]]