app/controllers/api/v1/notes_controller.rb

INSERT INTO "notes" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "abc"], ["body", "hgf"], ["created_at", "2017-09-12 19:21:33.653690"], ["updated_at", "2017-09-12 19:21:33.653690"]]
---
  def create

    @note = Note.create(note_params)